PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_crypto_core_aes.h
    return tmpResult;
}



/*******************************************************************************
* Function Name: Cy_Crypto_Core_Aes_GCM_SetKey
****************************************************************************//**
*
* The function to set AES GCM Key.
* When D-Cache is enabled parameters aeskey must align and end in 32 byte boundary.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param aesKey
* The pointer to the AES key.
*
* \param keyLength
* \ref cy_en_crypto_aes_key_length_t
*
* \param aesGCMctx
* The pointer to the AES GCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
* \funcusage
* \snippet crypto/snippet/main.c snippet_Cy_Crypto_Core_Aes_GCM_init_update_finish_free
*******************************************************************************/

__STATIC_INLINE cy_en_crypto_status_t Cy_Crypto_Core_Aes_GCM_SetKey(CRYPTO_Type *base, uint8_t const *aesKey, cy_en_crypto_aes_key_length_t keyLength,
        cy_stc_crypto_aes_gcm_state_t *aesGCMctx)
{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_NOT_SUPPORTED;

    if (CY_CRYPTO_V1)
    {
#if defined(CY_CRYPTO_CFG_HW_V1_ENABLE)
        tmpResult = CY_CRYPTO_NOT_SUPPORTED;
#endif /* defined(CY_CRYPTO_CFG_HW_V1_ENABLE) */
    }
    else
    {
#if defined(CY_CRYPTO_CFG_HW_V2_ENABLE)
        tmpResult = Cy_Crypto_Core_V2_Aes_GCM_SetKey(base, aesKey, keyLength, aesGCMctx);
#endif /* defined(CY_CRYPTO_CFG_HW_V2_ENABLE) */
    }

    return tmpResult;
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_Aes_GCM_Start
****************************************************************************//**
*
* The function to start AES GCM operation.
* When D-Cache is enabled parameters iv must align and end in 32 byte boundary.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param mode
* \ref cy_en_crypto_dir_mode_t
*
* \param iv
* The pointer to the Initialization vector.
*
* \param ivSize
* The length of the iv.
*
* \param aesGCMctx
* The pointer to the AES GCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
* \funcusage
* \snippet crypto/snippet/main.c snippet_Cy_Crypto_Core_Aes_GCM_init_update_finish_free
*******************************************************************************/

__STATIC_INLINE cy_en_crypto_status_t Cy_Crypto_Core_Aes_GCM_Start(CRYPTO_Type *base, cy_en_crypto_dir_mode_t mode,
        uint8_t const *iv, uint32_t ivSize,
        cy_stc_crypto_aes_gcm_state_t *aesGCMctx)
{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_NOT_SUPPORTED;

    if (CY_CRYPTO_V1)
    {
#if defined(CY_CRYPTO_CFG_HW_V1_ENABLE)
        tmpResult = CY_CRYPTO_NOT_SUPPORTED;
#endif /* defined(CY_CRYPTO_CFG_HW_V1_ENABLE) */
    }
    else
    {
#if defined(CY_CRYPTO_CFG_HW_V2_ENABLE)
        tmpResult = Cy_Crypto_Core_V2_Aes_GCM_Start(base, mode, iv, ivSize, aesGCMctx);
#endif /* defined(CY_CRYPTO_CFG_HW_V2_ENABLE) */
    }

    return tmpResult;
}



/*******************************************************************************
* Function Name: Cy_Crypto_Core_Aes_GCM_AAD_Update
****************************************************************************//**
*
* The function to update the Additional Authentication Data.
* When D-Cache is enabled parameters aad must align and end in 32 byte boundary.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param aad
* The pointer to the Additional Authentication Data.
*
* \param aadSize
*  The length of the Additional Authentication Data
*
* \param aesGCMctx
* The pointer to the AES GCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
* \funcusage
* \snippet crypto/snippet/main.c snippet_Cy_Crypto_Core_Aes_GCM_init_update_finish_free
*******************************************************************************/

__STATIC_INLINE cy_en_crypto_status_t Cy_Crypto_Core_Aes_GCM_AAD_Update(CRYPTO_Type *base, uint8_t *aad,
        uint32_t aadSize,
        cy_stc_crypto_aes_gcm_state_t *aesGCMctx)

{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_NOT_SUPPORTED;

    if (CY_CRYPTO_V1)
    {
#if defined(CY_CRYPTO_CFG_HW_V1_ENABLE)
        tmpResult = CY_CRYPTO_NOT_SUPPORTED;
#endif /* defined(CY_CRYPTO_CFG_HW_V1_ENABLE) */
    }
    else
    {
#if defined(CY_CRYPTO_CFG_HW_V2_ENABLE)
        tmpResult = Cy_Crypto_Core_V2_Aes_GCM_AAD_Update(base, aad, aadSize, aesGCMctx);
#endif /* defined(CY_CRYPTO_CFG_HW_V2_ENABLE) */
    }

    return tmpResult;
}



/*******************************************************************************
* Function Name: Cy_Crypto_Core_Aes_GCM_Update
****************************************************************************//**
*
* The function to update the data
* When D-Cache is enabled parameters input & output must align and end in 32 byte boundary.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param input
* The pointer to the input data to be encrypted/decrypted.
*
* \param inputSize
*  The length of the input data.
*
* \param output
* The pointer to the encrypted/decrypted output data.
*
* \param aesGCMctx
* The pointer to the AES GCm state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
* \funcusage
* \snippet crypto/snippet/main.c snippet_Cy_Crypto_Core_Aes_GCM_init_update_finish_free
*******************************************************************************/
__STATIC_INLINE cy_en_crypto_status_t Cy_Crypto_Core_Aes_GCM_Update(CRYPTO_Type *base,  const uint8_t *input,
        uint32_t inputSize,  uint8_t *output,
        cy_stc_crypto_aes_gcm_state_t *aesGCMctx)

{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_NOT_SUPPORTED;

    if (CY_CRYPTO_V1)
    {
#if defined(CY_CRYPTO_CFG_HW_V1_ENABLE)
        tmpResult = CY_CRYPTO_NOT_SUPPORTED;
#endif /* defined(CY_CRYPTO_CFG_HW_V1_ENABLE) */
    }
    else
    {
#if defined(CY_CRYPTO_CFG_HW_V2_ENABLE)
        tmpResult = Cy_Crypto_Core_V2_Aes_GCM_Update(base, input, inputSize, output, aesGCMctx);
#endif /* defined(CY_CRYPTO_CFG_HW_V2_ENABLE) */
    }

