PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_crypto_core_aes.h
    return tmpResult;
}
#endif /* (CPUSS_CRYPTO_GCM == 1) && defined(CY_CRYPTO_CFG_GCM_C)*/


#if defined(CY_CRYPTO_CFG_CCM_C)

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Aes_Ccm_Init
****************************************************************************//**
*
* Performs an AES CCM Init operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param aesCcmBuffer The buffers should be a SAHB mapped addresses.
* The pointer to the memory buffers storage.
*
* \param aesCcmState
* The pointer to the AES CCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/

__STATIC_INLINE cy_en_crypto_status_t Cy_Crypto_Core_Aes_Ccm_Init(CRYPTO_Type *base,
        cy_stc_crypto_aes_ccm_buffers_t *aesCcmBuffer, cy_stc_crypto_aes_ccm_state_t *aesCcmState)
{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_NOT_SUPPORTED;

    if (CY_CRYPTO_V1)
    {
#if defined(CY_CRYPTO_CFG_HW_V1_ENABLE)
        (void)base;
        (void)aesCcmBuffer;
        (void)aesCcmState;
        tmpResult = CY_CRYPTO_NOT_SUPPORTED;
#endif /* defined(CY_CRYPTO_CFG_HW_V1_ENABLE) */
    }
    else
    {
#if defined(CY_CRYPTO_CFG_HW_V2_ENABLE)
        tmpResult = Cy_Crypto_Core_V2_Aes_Ccm_Init(base, aesCcmBuffer, aesCcmState);
#endif /* defined(CY_CRYPTO_CFG_HW_V2_ENABLE) */
    }

    return tmpResult;
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_Aes_Ccm_SetKey
****************************************************************************//**
*
* Sets AES CCM Key for the operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param key
* The pointer to the CCM key.
*
* \param keyLength
* \ref cy_en_crypto_aes_key_length_t
*
* \param aesCcmState
* The pointer to the AES CCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
__STATIC_INLINE cy_en_crypto_status_t Cy_Crypto_Core_Aes_Ccm_SetKey(CRYPTO_Type *base,
        uint8_t const *key, cy_en_crypto_aes_key_length_t keyLength,
        cy_stc_crypto_aes_ccm_state_t *aesCcmState)
{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_NOT_SUPPORTED;

    if (CY_CRYPTO_V1)
    {
#if defined(CY_CRYPTO_CFG_HW_V1_ENABLE)
        (void)base;
        (void)key;
        (void)keyLength;
        (void)aesCcmState;
        tmpResult = CY_CRYPTO_NOT_SUPPORTED;
#endif /* defined(CY_CRYPTO_CFG_HW_V1_ENABLE) */
    }
    else
    {
#if defined(CY_CRYPTO_CFG_HW_V2_ENABLE)
        tmpResult = Cy_Crypto_Core_V2_Aes_Ccm_SetKey(base, key, keyLength, aesCcmState);
#endif /* defined(CY_CRYPTO_CFG_HW_V2_ENABLE) */
    }

    return tmpResult;

}



/*******************************************************************************
* Function Name: Cy_Crypto_Core_Aes_Ccm_Set_Length
****************************************************************************//**
*
* Sets the length for Additional authentication data, plain text and Tag for AES CCM operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param aadSize
* The Size of the Additional Authentication Data.
*
* \param textSize
* The Size of the Text.
*
* \param tagLength
* The Size of the Tag.
*
* \param aesCcmState
* The pointer to the AES CCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
__STATIC_INLINE cy_en_crypto_status_t Cy_Crypto_Core_Aes_Ccm_Set_Length(CRYPTO_Type *base,
        uint32_t aadSize,  uint32_t textSize, uint32_t tagLength,
        cy_stc_crypto_aes_ccm_state_t *aesCcmState)
{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_NOT_SUPPORTED;

    if (CY_CRYPTO_V1)
    {
#if defined(CY_CRYPTO_CFG_HW_V1_ENABLE)
        (void)base;
        (void)aadSize;
        (void)textSize;
        (void)tagLength;
        (void)aesCcmState;
        tmpResult = CY_CRYPTO_NOT_SUPPORTED;
#endif /* defined(CY_CRYPTO_CFG_HW_V1_ENABLE) */
    }
    else
    {
#if defined(CY_CRYPTO_CFG_HW_V2_ENABLE)
        tmpResult = Cy_Crypto_Core_V2_Aes_Ccm_Set_Length(base, aadSize, textSize, tagLength, aesCcmState);
#endif /* defined(CY_CRYPTO_CFG_HW_V2_ENABLE) */
    }

    return tmpResult;
}



/*******************************************************************************
* Function Name: Cy_Crypto_Core_Aes_Ccm_Start
****************************************************************************//**
*
* Function to set IV for the AES CCM operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param dirMode
* Can be \ref CY_CRYPTO_ENCRYPT or \ref CY_CRYPTO_DECRYPT
* (\ref cy_en_crypto_dir_mode_t)
*
* \param ivSize
* The size of the IV.
*
* \param iv
* The pointer to the IV.
*
* \param aesCcmState
* The pointer to the AES CCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/

__STATIC_INLINE cy_en_crypto_status_t Cy_Crypto_Core_Aes_Ccm_Start(CRYPTO_Type *base,
        cy_en_crypto_dir_mode_t dirMode,
        uint32_t ivSize, uint8_t const * iv,
        cy_stc_crypto_aes_ccm_state_t *aesCcmState)
{

    cy_en_crypto_status_t tmpResult = CY_CRYPTO_NOT_SUPPORTED;

    if (CY_CRYPTO_V1)
    {
#if defined(CY_CRYPTO_CFG_HW_V1_ENABLE)
        (void)base;
        (void)dirMode;
        (void)ivSize;
        (void)iv;
        (void)aesCcmState;
        tmpResult = CY_CRYPTO_NOT_SUPPORTED;
#endif /* defined(CY_CRYPTO_CFG_HW_V1_ENABLE) */
    }
    else
    {
#if defined(CY_CRYPTO_CFG_HW_V2_ENABLE)
        tmpResult = Cy_Crypto_Core_V2_Aes_Ccm_Start(base, dirMode, ivSize, iv, aesCcmState);
#endif /* defined(CY_CRYPTO_CFG_HW_V2_ENABLE) */
    }

